---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.KeynoteEntry
source: html/fbb17606-979e-c3d2-6436-a834cf2068ae.htm
---
# KeynoteEntry Members

Constructs a new KeynoteEntry from the given
 key name and keynote text. KeynoteEntry objects
 created from this constructor will not have parents.